# Словарь команд бота
LEXICON_COMMANDS_MENU: dict[str, str] = {
    '/start': 'Начать работу с ботом',
    '/show': 'Список товаров',
    '/add': 'Добавить товар',
    '/report': 'Отчеты',
    '/cancel': 'Отмена',
}

# Список русских размеров
LEXICON_RUSSIAN_SIZES: list[str] = ['40', '42', '44', '46', '48', '50', '52', '54', '56', '58', '40-42', '40-44', '40-46', '40-48', '40-50', '40-52', '40-54', '40-56', '40-58', '42-44', '42-46', '42-48', '42-50', '42-52', '42-54', '42-56', '42-58', '44-46', '44-48', '44-50', '44-52', '44-54', '44-56', '44-58', '46-48', '46-50', '46-52', '46-54', '46-56', '46-58', '48-50', '48-52', '48-54', '48-56', '48-58', '50-52', '50-54', '50-56', '50-58', '52-54', '52-56', '52-58', '54-56', '54-58', '56-58']

# Словарь валют
LEXICON_CURRENCIES: dict[str, str] = {
    'UAH': '₴',
    'USD': '$',
    'EUR': '€',
}
